
//发送卡拓扑图
function tuopu() {

    var ledParasJson = null ;
    var senderOrderList = [] ;

    //网口初始值-X轴上单个偏移差值为60一个单位(向右+60)
    var XInitPort = 290;
    //网口初始值-Y轴上单个偏移差值为70一个单位（向下-70）
    var YInitPort = 1000;
    //网口最大总数量
    var MaxPort = 16;

    //X轴上单个偏移差值为60一个单位(向右+60)----屏体（同网口）
    var XInit = 660;
    //Y轴上单个偏移差值为140一个单位(向下-140)----屏体
    var YInit = 960;
    //矢量图形组
    var nodes = [{
        x: 0,
        y: 600,
        nodeName: '控制卡',
        name: '控制卡',
        type: '播放器',
        svgPath: 'M885.76 919.552H116.736C53.248 919.552 1.024 867.328 1.024 803.84V284.672c0-63.488 52.224-115.712 115.712-115.712h769.024c63.488 0 115.712 52.224 115.712 115.712v519.168c0 63.488-52.224 115.712-115.712 115.712zM116.736 226.304c-31.744 0-58.368 25.6-58.368 58.368v519.168c0 31.744 25.6 58.368 58.368 58.368h769.024c31.744 0 58.368-25.6 58.368-58.368V284.672c0-31.744-25.6-58.368-58.368-58.368H116.736z M432.128 740.352c-15.36 0-30.72-4.096-44.032-12.288-25.6-15.36-40.96-43.008-40.96-72.704V458.752c0-30.72 15.36-57.344 40.96-72.704s57.344-16.384 83.968-2.048L658.432 481.28c27.648 14.336 46.08 44.032 46.08 75.776 0 31.744-17.408 60.416-46.08 75.776l-185.344 98.304c-13.312 6.144-26.624 9.216-40.96 9.216z m1.024-279.552v191.488l182.272-96.256L433.152 460.8z m184.32 97.28l20.48-37.888-20.48 37.888z',
        symbolSize: 70,

    }, {
        x: 200,
        y: 1000,
        nodeName: 'SENDER1',
        name: 'SENDER1',
        type: '发送卡',
        svgPath: 'M868.48 104.96H155.52a32 32 0 0 0-32 32v538.24a32 32 0 0 0 32 32h712.96a32 32 0 0 0 32-32V136.96a32 32 0 0 0-32-32z m-32 64V390.4H187.52V168.96zM187.52 643.2V422.4h648.96v221.44z M252.8 232.96h32v74.88h-32zM334.72 232.96h32v74.88h-32zM252.8 502.4h32v74.88h-32zM334.72 502.4h32v74.88h-32zM868.48 853.12H600.96a94.72 94.72 0 0 0-56.96-56.96v-53.76h-64v53.76a94.72 94.72 0 0 0-56.96 56.96H155.52a32 32 0 1 0 0 64h267.52a94.08 94.08 0 0 0 177.92 0h267.52a32 32 0 0 0 0-64zM512 915.84a30.72 30.72 0 1 1 30.72-30.72 30.72 30.72 0 0 1-30.72 30.72z'
    },
        {
            x: 290,
            y: 1000,
            symbolSize: 20,
            nodeName: 'P1',
            name: 'P1',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 290,
            y: 930,
            symbolSize: 20,
            nodeName: 'P2',
            name: 'P2',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 290,
            y: 860,
            symbolSize: 20,
            nodeName: 'P3',
            name: 'P3',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 290,
            y: 790,
            symbolSize: 20,
            nodeName: 'P4',
            name: 'P4',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 350,
            y: 1000,
            symbolSize: 20,
            nodeName: 'P5',
            name: 'P5',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 350,
            y: 930,
            symbolSize: 20,
            nodeName: 'P6',
            name: 'P6',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 350,
            y: 860,
            symbolSize: 20,
            nodeName: 'P7',
            name: 'P7',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 350,
            y: 790,
            symbolSize: 20,
            nodeName: 'P8',
            name: 'P8',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 410,
            y: 1000,
            symbolSize: 20,
            nodeName: 'P9',
            name: 'P9',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 410,
            y: 930,
            symbolSize: 20,
            nodeName: 'P10',
            name: 'P10',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 410,
            y: 860,
            symbolSize: 20,
            nodeName: 'P11',
            name: 'P11',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 410,
            y: 790,
            symbolSize: 20,
            nodeName: 'P12',
            name: 'P12',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 470,
            y: 1000,
            symbolSize: 20,
            nodeName: 'P13',
            name: 'P13',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 470,
            y: 930,
            symbolSize: 20,
            nodeName: 'P14',
            name: 'P14',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 470,
            y: 860,
            symbolSize: 20,
            nodeName: 'P15',
            name: 'P15',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 470,
            y: 790,
            symbolSize: 20,
            nodeName: 'P16',
            name: 'P16',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 660,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体1',
            name: '屏体1',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 660,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体2',
            name: '屏体2',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 660,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体3',
            name: '屏体3',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        }, {
            x: 660,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体4',
            name: '屏体4',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 662,
            y: 400,
            symbolSize: 46,
            nodeName: '屏体5',
            name: '屏体5',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 662,
            y: 260,
            symbolSize: 46,
            nodeName: '屏体6',
            name: '屏体6',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 662,
            y: 120,
            symbolSize: 46,
            nodeName: '屏体7',
            name: '屏体7',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 662,
            y: -20,
            symbolSize: 46,
            nodeName: '屏体8',
            name: '屏体8',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 723,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体9',
            name: '屏体9',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        }, {
            x: 723,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体10',
            name: '屏体10',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        }, {
            x: 723,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体11',
            name: '屏体11',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 723,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体12',
            name: '屏体12',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 723,
            y: 400,
            symbolSize: 46,
            nodeName: '屏体13',
            name: '屏体13',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 723,
            y: 260,
            symbolSize: 46,
            nodeName: '屏体14',
            name: '屏体14',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 723,
            y: 120,
            symbolSize: 46,
            nodeName: '屏体15',
            name: '屏体15',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 723,
            y: -20,
            symbolSize: 46,
            nodeName: '屏体16',
            name: '屏体16',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体17',
            name: '屏体17',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体18',
            name: '屏体18',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体19',
            name: '屏体19',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体20',
            name: '屏体20',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 400,
            symbolSize: 46,
            nodeName: '屏体21',
            name: '屏体21',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 260,
            symbolSize: 46,
            nodeName: '屏体22',
            name: '屏体22',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 120,
            symbolSize: 46,
            nodeName: '屏体23',
            name: '屏体23',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: -20,
            symbolSize: 46,
            nodeName: '屏体24',
            name: '屏体24',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体25',
            name: '屏体25',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体26',
            name: '屏体26',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体27',
            name: '屏体27',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体28',
            name: '屏体28',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 400,
            symbolSize: 46,
            nodeName: '屏体29',
            name: '屏体29',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 260,
            symbolSize: 46,
            nodeName: '屏体30',
            name: '屏体30',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 120,
            symbolSize: 46,
            nodeName: '屏体31',
            name: '屏体31',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: -20,
            symbolSize: 46,
            nodeName: '屏体32',
            name: '屏体32',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体33',
            name: '屏体33',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体34',
            name: '屏体34',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体35',
            name: '屏体35',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体36',
            name: '屏体36',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 400,
            symbolSize: 46,
            nodeName: '屏体37',
            name: '屏体37',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 260,
            symbolSize: 46,
            nodeName: '屏体38',
            name: '屏体38',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 120,
            symbolSize: 46,
            nodeName: '屏体39',
            name: '屏体39',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: -20,
            symbolSize: 46,
            nodeName: '屏体40',
            name: '屏体40',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体41',
            name: '屏体41',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体42',
            name: '屏体42',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体43',
            name: '屏体43',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体44',
            name: '屏体44',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 400,
            symbolSize: 46,
            nodeName: '屏体45',
            name: '屏体45',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 260,
            symbolSize: 46,
            nodeName: '屏体46',
            name: '屏体46',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 120,
            symbolSize: 46,
            nodeName: '屏体47',
            name: '屏体47',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: -20,
            symbolSize: 46,
            nodeName: '屏体48',
            name: '屏体48',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体49',
            name: '屏体49',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体50',
            name: '屏体50',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体51',
            name: '屏体51',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体52',
            name: '屏体52',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 400,
            symbolSize: 46,
            nodeName: '屏体53',
            name: '屏体53',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 260,
            symbolSize: 46,
            nodeName: '屏体54',
            name: '屏体54',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 120,
            symbolSize: 46,
            nodeName: '屏体55',
            name: '屏体55',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: -20,
            symbolSize: 46,
            nodeName: '屏体56',
            name: '屏体56',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体57',
            name: '屏体57',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体58',
            name: '屏体58',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体59',
            name: '屏体59',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体60',
            name: '屏体60',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 400,
            symbolSize: 46,
            nodeName: '屏体61',
            name: '屏体61',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 260,
            symbolSize: 46,
            nodeName: '屏体62',
            name: '屏体62',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 120,
            symbolSize: 46,
            nodeName: '屏体63',
            name: '屏体63',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: -20,
            symbolSize: 46,
            nodeName: '屏体64',
            name: '屏体64',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        }
    ]
    //连接线数组
    var links = [
        {
            source: '控制卡',
            target: 'SENDER1',
            name: '连通',
            type: '网线',
            nodeName: '主网线'

        },
        {
            source: 'P1',
            target: '屏体1',
            name: '连通',
            type: '网线',
            nodeName: '网线1'

        },
        {
            source: '屏体1',
            target: '屏体2',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体2',
            target: '屏体3',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体3',
            target: '屏体4',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: 'P2',
            target: '屏体5',
            name: '连通',
            type: '网线',
            nodeName: '网线1'

        },
        {
            source: '屏体5',
            target: '屏体6',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体6',
            target: '屏体7',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体7',
            target: '屏体8',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: 'P3',
            target: '屏体9',
            name: '连通',
            type: '网线',
            nodeName: '网线1'

        },
        {
            source: '屏体9',
            target: '屏体10',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体10',
            target: '屏体11',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体11',
            target: '屏体12',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: 'P4',
            target: '屏体13',
            name: '连通',
            type: '网线',
            nodeName: '网线1'

        },
        {
            source: '屏体13',
            target: '屏体14',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体14',
            target: '屏体15',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体15',
            target: '屏体16',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: 'P5',
            target: '屏体17',
            name: '连通',
            type: '网线',
            nodeName: '网线1'

        },
        {
            source: '屏体17',
            target: '屏体18',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体18',
            target: '屏体19',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体19',
            target: '屏体20',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: 'P6',
            target: '屏体21',
            name: '连通',
            type: '网线',
            nodeName: '网线1'

        },
        {
            source: '屏体21',
            target: '屏体22',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体22',
            target: '屏体23',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: '屏体23',
            target: '屏体24',
            name: '连通',
            type: '网线',
            nodeName: '串联'

        },
        {
            source: 'P7',
            target: '屏体25',
            name: '连通',
            type: '网线',
            nodeName: '网线1'

        },
        {
            source: '屏体25',
            target: '屏体26',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体26',
            target: '屏体27',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体27',
            target: '屏体28',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: 'P8',
            target: '屏体29',
            name: '连通',
            type: '网线',
            nodeName: '网线1'
        },
        {
            source: '屏体29',
            target: '屏体30',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体30',
            target: '屏体31',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体31',
            target: '屏体32',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: 'P9',
            target: '屏体33',
            name: '连通',
            type: '网线',
            nodeName: '网线1'
        },
        {
            source: '屏体33',
            target: '屏体34',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体34',
            target: '屏体35',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体35',
            target: '屏体36',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: 'P10',
            target: '屏体37',
            name: '连通',
            type: '网线',
            nodeName: '网线1'
        },
        {
            source: '屏体37',
            target: '屏体38',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体38',
            target: '屏体39',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体39',
            target: '屏体40',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: 'P11',
            target: '屏体41',
            name: '连通',
            type: '网线',
            nodeName: '网线1'
        },
        {
            source: '屏体41',
            target: '屏体42',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体42',
            target: '屏体43',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体43',
            target: '屏体44',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: 'P12',
            target: '屏体45',
            name: '连通',
            type: '网线',
            nodeName: '网线1'
        },
        {
            source: '屏体45',
            target: '屏体46',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体46',
            target: '屏体47',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体47',
            target: '屏体48',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: 'P13',
            target: '屏体49',
            name: '连通',
            type: '网线',
            nodeName: '网线1'
        },
        {
            source: '屏体49',
            target: '屏体50',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体50',
            target: '屏体51',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体51',
            target: '屏体52',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: 'P14',
            target: '屏体53',
            name: '连通',
            type: '网线',
            nodeName: '网线1'
        },
        {
            source: '屏体53',
            target: '屏体54',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体54',
            target: '屏体55',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体55',
            target: '屏体56',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: 'P15',
            target: '屏体57',
            name: '连通',
            type: '网线',
            nodeName: '网线1'
        },
        {
            source: '屏体57',
            target: '屏体58',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体58',
            target: '屏体59',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体59',
            target: '屏体60',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: 'P16',
            target: '屏体61',
            name: '连通',
            type: '网线',
            nodeName: '网线1'
        },
        {
            source: '屏体61',
            target: '屏体62',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体62',
            target: '屏体63',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        },
        {
            source: '屏体63',
            target: '屏体64',
            name: '连通',
            type: '网线',
            nodeName: '串联'
        }
    ]
    //走线方式数组
    var portGroup = [];
    var charts = {
        //拓扑模块
        nodes: [],
        //目标连接线
        links: [],
        //网格线
        linesData: []
    }

    //请求后台参数
    $.ajax({
        url: "/getJsonMessage",
        data:null,
        type: "GET",
        dataType: "json",
        success: function(data) {
            for(var i = 0;i<data.comList.length;i++){
                //获取屏幕对象
                ledParasJson = data.comList[i].ledParas;
                //发送卡数组
                senderOrderList = ledParasJson.senderOrderList;

                //遍历发送卡列表可知发送卡数量
                for(var i = 0;i<senderOrderList.length;i++){
                    //当前发送卡信息
                    var senderOrder = senderOrderList[i];

                    //获取走线端口数量
                    var portNum = senderOrder.portOrder.length;
                    //遍历走线接口
                    for(var j = 0;j<portNum;j++){
                        //走线详情信息
                        var port = senderOrder.portOrder[j];
                        console.log(port);
                        //判断索引是否能够取余4来判断在当前X轴的Y位置
                        if((j+1)%4 == 0){
                            //当前port对象
                            var singlePort = {
                                //X轴上单个偏移差值为60一个单位(向右+60)
                                x: 290+parseInt((j+1)/4-1)*60,
                                //Y轴上单个偏移差值为70一个单位（向下-70）
                                y: 1000-3*70,
                                symbolSize: 20,
                                nodeName: port.id,
                                name: port.id,
                                type: '网口',
                                svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
                            };
                            //走线方式数组添加
                            portGroup.push(singlePort);
                        }else{
                            var singlePort = {
                                //X轴上单个偏移差值为60一个单位(向右+60)
                                x: 290+parseInt((j+1)/4)*60,
                                //Y轴上单个偏移差值为70一个单位（向下-70）
                                y: 1000-(j)%4*70,
                                symbolSize: 20,
                                nodeName: port.id,
                                name: port.id,
                                type: '网口',
                                svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
                            };
                            portGroup.push(singlePort);
                        }
                        console.log(portGroup);
                    }
                }
            }
            // data = jQuery.parseJSON(data);
            // dataType指明了返回数据为json类型，故不需要再反序列化
        },
        error: function () {
            alert("获取后台参数失败");
        }
    });

    // 基于准备好的dom，初始化echarts实例
    var myChart = echarts.init(document.getElementById('tuopu'));

    var dataMap = new Map()
    //遍历SVG图形
    for (var j = 0; j < nodes.length; j++) {
        const {
            x,
            y,
            nodeName,
            name,
            type,
            svgPath,
            symbolSize
        } = nodes[j];
        if(type == '屏体'){
            var node = {
                nodeName,
                name,
                type,
                value: [x, y],
                symbolSize: symbolSize || 50,
                symbol: 'path://' + svgPath,
                itemStyle: {
                    color: '#043c58',
                    emphasis: {
                        color: '#1D5D76'
                    },
                }
            }
            dataMap.set(nodes[j].name, [x, y])
            charts.nodes.push(node)
        }else{
            var node = {
                nodeName,
                name,
                type,
                value: [x, y],
                symbolSize: symbolSize || 50,
                symbol: 'path://' + svgPath,
                itemStyle: {
                    color: 'orange',
                    emphasis: {
                        color: '#FFDD00'
                    },
                }
            }
            dataMap.set(nodes[j].name, [x, y])
            charts.nodes.push(node)
        }
    }

    //遍历目标连接线
    for (var i = 0; i < links.length; i++) {
        var link = {
            source: links[i].source,
            target: links[i].target,
            type: links[i].type,
            nodeName: links[i].nodeName,
            label: {
                normal:{
                  show:false
                },
                emphasis:{
                    symbolSize:8,
                    fontSize:38,
                    color:'red',
                    show: true,
                    formatter: links[i].name
                }
            },
            lineStyle: {
                normal: {
                    curveness:0.15,
                    symbolSize:0
                },
                emphasis:{
                    symbolSize:8,
                    type: 'solid',
                    color: '#20A0FF'
                }
            }
        }
        charts.links.push(link);
        // 组装动态移动的效果数据
        var lines = {
            coords:[
                dataMap.get(links[i].source),
                dataMap.get(links[i].target)
                    ]
                    };
        charts.linesData.push(lines);
    }
    option = {
        //提示框显示
        tooltip: {
                //显示延迟
            showDelay: 300,
            backgroundColor: '#1F2D3D',
            borderColor: '#324057',
            borderRadius: 4,           // 提示边框圆角，单位px，默认为4
            borderWidth: 1,            // 提示边框线宽，单位px，默认为0（无边框）
            padding: 5,                // 提示内边距，单位px，默认各方向内边距为5，
            axisPointer : {            // 坐标轴指示器，坐标轴触发有效
               type : 'line',         // 默认为直线，可选为：'line' | 'shadow'
               lineStyle : {          // 直线指示器样式设置
                color: '#48b',
                width: 2,
                type: 'solid'
            },
            shadowStyle : {                       // 阴影指示器样式设置
                width: 'auto',                   // 阴影大小
                color: '#475669'  // 阴影颜色
            }
        },
                //动画变换延迟单位：s
                transitionDuration: 0.8,
                // formatter: '设备类型:{b}<br />序列号:<br />'
                formatter: function (item) {
                    return '设备类型:<b style="color: green;">&nbsp;&nbsp;' + item.data.type + '</b><hr />' +
                        '设备ID:<b style="color: green;">&nbsp;&nbsp;' + item.data.nodeName + '</b><hr />' +
                        '型号：<b style="color: green;"></b><hr />' +
                        '信号强度：<b style="color: green;">强</b><hr />' +
                        '工作状态：<b style="color: green;">正常</b><hr />'
                }
            },
            // backgroundColor: "#0B1321",
            xAxis: {
                min: 0,
                max: 1000,
                show: false,
                type: 'value'
            },
            yAxis: {
                min: 0,
                max: 1000,
                show: false,
                type: 'value'
            },
            series: [{
                type: 'graph',
                coordinateSystem: 'cartesian2d',
                focusNodeAdjacency: true, // 鼠标移到节点上突出显示节点以及节点的边和邻接节点
                lineStyle: {
                    normal: {
                        width: 2,
                        shadowColor: 'none'
                    }
                },
                edgeSymbol: ['circle', 'arrow'],
                edgeSymbolSize: [4, 10],
                label: {
                    show: true,
                    position: 'bottom',
                    color: 'orange',
                    formatter: function (item) {
                        return item.data.nodeName
                    }
                },
                data: charts.nodes,
                links: charts.links
            },
            //     {
            //     type: 'lines',
            //     polyline: true,
            //     coordinateSystem: 'cartesian2d',
            //     lineStyle: {
            //         //设置网格线类型 dotted：虚线   solid:实线
            //         type: 'solid',
            //         width: 1,
            //         color: '#175064',
            //         curveness: 0.1
            //
            //     },
            //     effect: {
            //         show: true,
            //         trailLength: 0.1,
            //         symbol: 'arrow',
            //         color: 'orange',
            //         symbolSize: 8
            //     },
            //     data: charts.linesData
            // }
            ]
        };
    // 使用刚指定的配置项和数据显示图表。
    myChart.setOption(option);
    // 处理点击事件并且弹出数据名称-params传入的参数
        myChart.on('click', function (params) {
            if(params.data.type == '屏体'){
                $('#cover').css('display','block'); //显示遮罩层
                $('.container').attr('style', 'visibility: visible').find('.pop-up').attr('style', 'visibility: visible').siblings().attr('style', 'visibility: hidden');
            }else{
             alert("暂未开放");
            }
        });
}

//点击close-pop这个类时取消弹框
$('.close-pop').on('click', function () {
    $('#cover').css('display','none');
    $(this).parent().parent().hide().find('.cont-div').attr('style', 'visibility: hidden');
})

tuopu();

function aiguozhe(item){
    if($('.modedetail').css('display') === 'none'){
        $('.modedetail').attr('style','display:block;');
        $('.set-div').attr('style','z-index:1;');
    }else{
        $(".modedetail").hide();
        $('.set-div').attr('style','z-index:3;');
    }
}

// $(document).on('click',function (e) {
//     var target = $(e.target);
//     if(target.closest(".modedetail").length == 0 && target.closest(".module").length == 0){
//         $(".modedetail").hide();
//     }
// })



