
$('.select').on('blur', function () {
        $(this).find('.select-ul').hide();
    })
    //下拉框点击出现下拉框内容
$('.select-div').on('click', function () {
    if ($(this).siblings('.select-ul').is(":hidden")) {
        $(this).siblings('.select-ul').show();
    } else {
        $(this).siblings('.select-ul').hide();
    }
})


$('.select-ul').on('click', 'li', function () {
    $(this).addClass('active').siblings('li').removeClass('active').parent().hide().siblings('.select-div').html($(this).html());
    var parentDiv = $(this).parent().parent().parent();
})

//鼠标滑动到按钮，按钮内容变成白色
var imgName;
$('.title-box').children('button').hover(function () {
    imgName = $(this).children('img').attr('src').split('.png')[0];
    $(this).children('img').attr('src', imgName + '_on.png');
}, function () {
    $(this).children('img').attr('src', imgName + '.png');

});


//发送卡拓扑图
function tuopu() {
    // 基于准备好的dom，初始化echarts实例
    var myChart = echarts.init(document.getElementById('tuopu'));

    var nodes = [{
        x: 0,
        y: 600,
        nodeName: '控制卡',
        name: '控制卡',
        type: '播放器',
        svgPath: 'M885.76 919.552H116.736C53.248 919.552 1.024 867.328 1.024 803.84V284.672c0-63.488 52.224-115.712 115.712-115.712h769.024c63.488 0 115.712 52.224 115.712 115.712v519.168c0 63.488-52.224 115.712-115.712 115.712zM116.736 226.304c-31.744 0-58.368 25.6-58.368 58.368v519.168c0 31.744 25.6 58.368 58.368 58.368h769.024c31.744 0 58.368-25.6 58.368-58.368V284.672c0-31.744-25.6-58.368-58.368-58.368H116.736z M432.128 740.352c-15.36 0-30.72-4.096-44.032-12.288-25.6-15.36-40.96-43.008-40.96-72.704V458.752c0-30.72 15.36-57.344 40.96-72.704s57.344-16.384 83.968-2.048L658.432 481.28c27.648 14.336 46.08 44.032 46.08 75.776 0 31.744-17.408 60.416-46.08 75.776l-185.344 98.304c-13.312 6.144-26.624 9.216-40.96 9.216z m1.024-279.552v191.488l182.272-96.256L433.152 460.8z m184.32 97.28l20.48-37.888-20.48 37.888z',
        symbolSize: 70,

    }, {
        x: 200,
        y: 1000,
        nodeName: 'SENDER1',
        name: 'SENDER1',
        type: '发送卡',
        svgPath: 'M868.48 104.96H155.52a32 32 0 0 0-32 32v538.24a32 32 0 0 0 32 32h712.96a32 32 0 0 0 32-32V136.96a32 32 0 0 0-32-32z m-32 64V390.4H187.52V168.96zM187.52 643.2V422.4h648.96v221.44z M252.8 232.96h32v74.88h-32zM334.72 232.96h32v74.88h-32zM252.8 502.4h32v74.88h-32zM334.72 502.4h32v74.88h-32zM868.48 853.12H600.96a94.72 94.72 0 0 0-56.96-56.96v-53.76h-64v53.76a94.72 94.72 0 0 0-56.96 56.96H155.52a32 32 0 1 0 0 64h267.52a94.08 94.08 0 0 0 177.92 0h267.52a32 32 0 0 0 0-64zM512 915.84a30.72 30.72 0 1 1 30.72-30.72 30.72 30.72 0 0 1-30.72 30.72z'
    },
        {
            x: 290,
            y: 1000,
            symbolSize: 20,
            nodeName: 'P1',
            name: 'P1',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 290,
            y: 930,
            symbolSize: 20,
            nodeName: 'P2',
            name: 'P2',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 290,
            y: 860,
            symbolSize: 20,
            nodeName: 'P3',
            name: 'P3',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 290,
            y: 790,
            symbolSize: 20,
            nodeName: 'P4',
            name: 'P4',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 350,
            y: 1000,
            symbolSize: 20,
            nodeName: 'P5',
            name: 'P5',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 350,
            y: 930,
            symbolSize: 20,
            nodeName: 'P6',
            name: 'P6',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 350,
            y: 860,
            symbolSize: 20,
            nodeName: 'P7',
            name: 'P7',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 350,
            y: 790,
            symbolSize: 20,
            nodeName: 'P8',
            name: 'P8',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 410,
            y: 1000,
            symbolSize: 20,
            nodeName: 'P9',
            name: 'P9',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 410,
            y: 930,
            symbolSize: 20,
            nodeName: 'P10',
            name: 'P10',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 410,
            y: 860,
            symbolSize: 20,
            nodeName: 'P11',
            name: 'P11',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 410,
            y: 790,
            symbolSize: 20,
            nodeName: 'P12',
            name: 'P12',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 470,
            y: 1000,
            symbolSize: 20,
            nodeName: 'P13',
            name: 'P13',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 470,
            y: 930,
            symbolSize: 20,
            nodeName: 'P14',
            name: 'P14',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 470,
            y: 860,
            symbolSize: 20,
            nodeName: 'P15',
            name: 'P15',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 470,
            y: 790,
            symbolSize: 20,
            nodeName: 'P16',
            name: 'P16',
            type: '网口',
            svgPath: 'M509.92 176C325.504 176 176 325.504 176 509.92c0 184.416 149.504 333.92 333.92 333.92 184.416 0 333.92-149.504 333.92-333.92C843.84 325.504 694.32 176 509.92 176z m0 48c157.904 0 285.92 128 285.92 285.92 0 157.904-128.016 285.92-285.92 285.92C352 795.84 224 667.808 224 509.92 224 352 352 224 509.92 224z m0 96C405.024 320 320 405.024 320 509.92c0 104.88 85.024 189.92 189.92 189.92 104.88 0 189.92-85.04 189.92-189.92 0-104.896-85.04-189.92-189.92-189.92z',
        },
        {
            x: 660,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体1',
            name: '屏体1',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 660,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体2',
            name: '屏体2',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 660,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体3',
            name: '屏体3',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        }, {
            x: 660,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体4',
            name: '屏体4',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 662,
            y: 400,
            symbolSize: 46,
            nodeName: '屏体33',
            name: '屏体33',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 662,
            y: 260,
            symbolSize: 46,
            nodeName: '屏体34',
            name: '屏体34',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 723,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体5',
            name: '屏体5',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        }, {
            x: 723,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体6',
            name: '屏体6',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        }, {
            x: 723,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体7',
            name: '屏体7',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        }, {
            x: 723,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体8',
            name: '屏体8',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体9',
            name: '屏体9',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体10',
            name: '屏体10',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体11',
            name: '屏体11',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 780,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体12',
            name: '屏体12',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体13',
            name: '屏体13',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体14',
            name: '屏体14',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体15',
            name: '屏体15',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 840,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体16',
            name: '屏体16',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体17',
            name: '屏体17',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体18',
            name: '屏体18',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体19',
            name: '屏体19',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 900,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体20',
            name: '屏体20',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体21',
            name: '屏体21',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体22',
            name: '屏体22',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体23',
            name: '屏体23',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 960,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体24',
            name: '屏体24',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体25',
            name: '屏体25',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体26',
            name: '屏体26',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体27',
            name: '屏体27',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1020,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体28',
            name: '屏体28',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 960,
            symbolSize: 46,
            nodeName: '屏体29',
            name: '屏体29',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 820,
            symbolSize: 46,
            nodeName: '屏体30',
            name: '屏体30',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 680,
            symbolSize: 46,
            nodeName: '屏体31',
            name: '屏体31',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
        {
            x: 1080,
            y: 540,
            symbolSize: 46,
            nodeName: '屏体32',
            name: '屏体32',
            type: '屏体',
            svgPath: 'M651.636364 1024V558.545455h558.545454v465.454545z '
        },
    ]
    var links = [
        {
            source: '控制卡',
            target: 'SENDER1',
            name: '连通',
            type: '网线',
            nodeName: '主网线'

        },
        {
            source: 'P1',
            target: '屏体1',
            name: '连通',
            type: '网线',
            nodeName: '网线1'

        },
        {
            source: 'P9',
            target: '屏体33',
            name: '连通',
            type: '网线',
            nodeName: '网线1'

        },
        {
            source: '屏体33',
            target: '屏体34',
            name: '连通',
            type: '网线',
            nodeName: '串联1'
        }
    ]
    var charts = {
        //拓扑模块
        nodes: [],
        //目标连接线
        links: [],
        //网格线
        linesData: [
            {//P2屏体拓扑连接线
            coords: [
                [290, 930],
                [310, 930],
                [310, 1090],
                [723, 1090],
                [723, 490]
            ]
        }, {//P3屏体拓扑连接线
            coords: [
                [290, 860],
                [320, 860],
                [320, 1080],
                [780, 1080],
                [780, 490]
            ]
        }, {//P4屏体拓扑连接线
            coords: [
                [290, 790],
                [330, 790],
                [330, 1070],
                [840, 1070],
                [840, 490]
            ]
        }, {//P5屏体拓扑连接线
            coords: [
                [350, 1000],
                [350, 1060],
                [900, 1060],
                [900, 490]
            ]
        }, {//P6屏体拓扑连接线
            coords: [
                [350, 930],
                [369, 930],
                [369, 1050],
                [960, 1050],
                [960, 490]
            ]
        }, {//P7屏体拓扑连接线
            coords: [
                [350, 860],
                [380, 860],
                [380, 1040],
                [1020, 1040],
                [1020, 490]
            ]
        }, {//P8屏体拓扑连接线
            coords: [
                [350, 790],
                [390, 790],
                [390, 1030],
                [1080, 1030],
                [1080, 490]
            ]
        }
        ]
    }
    var dataMap = new Map()
    //遍历SVG图形
    for (var j = 0; j < nodes.length; j++) {
        const {
            x,
            y,
            nodeName,
            name,
            type,
            svgPath,
            symbolSize
        } = nodes[j];
        if(type == '屏体'){
            var node = {
                nodeName,
                name,
                type,
                value: [x, y],
                symbolSize: symbolSize || 50,
                symbol: 'path://' + svgPath,
                itemStyle: {
                    color: '#043c58',
                    emphasis: {
                        color: '#1D5D76'
                    },
                }
            }
            dataMap.set(nodes[j].name, [x, y])
            charts.nodes.push(node)
        }else{
            var node = {
                nodeName,
                name,
                type,
                value: [x, y],
                symbolSize: symbolSize || 50,
                symbol: 'path://' + svgPath,
                itemStyle: {
                    color: 'orange',
                    emphasis: {
                        color: '#FFDD00'
                    },
                }
            }
            dataMap.set(nodes[j].name, [x, y])
            charts.nodes.push(node)
        }
    }

    //遍历目标连接线
    for (var i = 0; i < links.length; i++) {
        var link = {
            source: links[i].source,
            target: links[i].target,
            type: links[i].type,
            nodeName: links[i].nodeName,
            label: {
                emphasis:{
                    symbolSize:8,
                    fontSize:38,
                    show: true,
                    formatter: links[i].name
                }
            },
            lineStyle: {
                normal: {
                    show:true,
                    type: 'solid',
                    color: '#20A0FF'
                },
            }
        }
        charts.links.push(link);
        // 组装动态移动的效果数据
        var lines = {
            coords:[
                dataMap.get(links[i].source),
                dataMap.get(links[i].target)
                    ]
                    };
        charts.linesData.push(lines);
    }
    option = {
        //提示框显示
        tooltip: {
                //显示延迟
            showDelay: 300,
            backgroundColor: '#1F2D3D',
            borderColor: '#324057',
            borderRadius: 4,           // 提示边框圆角，单位px，默认为4
            borderWidth: 1,            // 提示边框线宽，单位px，默认为0（无边框）
            padding: 5,                // 提示内边距，单位px，默认各方向内边距为5，
            axisPointer : {            // 坐标轴指示器，坐标轴触发有效
               type : 'line',         // 默认为直线，可选为：'line' | 'shadow'
               lineStyle : {          // 直线指示器样式设置
                color: '#48b',
                width: 2,
                type: 'solid'
            },
            shadowStyle : {                       // 阴影指示器样式设置
                width: 'auto',                   // 阴影大小
                color: '#475669'  // 阴影颜色
            }
        },
                //动画变换延迟单位：s
                transitionDuration: 0.8,
                // formatter: '设备类型:{b}<br />序列号:<br />'
                formatter: function (item) {
                    return '设备类型:<b style="color: green;">&nbsp;&nbsp;' + item.data.type + '</b><hr />' +
                        '设备ID:<b style="color: green;">&nbsp;&nbsp;' + item.data.nodeName + '</b><hr />' +
                        '型号：<b style="color: green;"></b><hr />' +
                        '信号强度：<b style="color: green;">强</b><hr />' +
                        '工作状态：<b style="color: green;">正常</b><hr />'
                }
            },
            // backgroundColor: "#0B1321",
            xAxis: {
                min: 0,
                max: 1000,
                show: false,
                type: 'value'
            },
            yAxis: {
                min: 0,
                max: 1000,
                show: false,
                type: 'value'
            },
            series: [{
                type: 'graph',
                coordinateSystem: 'cartesian2d',
                focusNodeAdjacency: true, // 鼠标移到节点上突出显示节点以及节点的边和邻接节点
                edgeSymbol: ['circle', 'arrow'],
                edgeSymbolSize: [4, 10],
                label: {
                    show: true,
                    position: 'bottom',
                    color: 'orange',
                    formatter: function (item) {
                        return item.data.nodeName
                    }
                },
                data: charts.nodes,
                links: charts.links
            },
            //     {
            //     type: 'lines',
            //     polyline: true,
            //     coordinateSystem: 'cartesian2d',
            //     lineStyle: {
            //         //设置网格线类型 dotted：虚线   solid:实线
            //         type: 'solid',
            //         width: 1,
            //         color: '#175064',
            //         curveness: 0.1
            //
            //     },
            //     effect: {
            //         show: true,
            //         trailLength: 0.1,
            //         symbol: 'arrow',
            //         color: 'orange',
            //         symbolSize: 8
            //     },
            //     data: charts.linesData
            // }
            ]
        };
    // 使用刚指定的配置项和数据显示图表。
    myChart.setOption(option);
}

tuopu();

$('#dateBtn').on('click', function () {
    if ($('#timeBox').is(":hidden")) {
        $('#timeBox').show();
        document.getElementById('timeBox').focus();

    } else {
        $('#timeBox').hide();
    }
})

$('#dateBtns').on('click', function () {
    if ($('#timeBoxs').is(":hidden")) {
        $('#timeBoxs').show();
        document.getElementById('timeBoxs').focus();

    } else {
        $('#timeBoxs').hide();
    }
})

$('#switchBtn').on('click', 'span', function () {
    $(this).addClass('active').siblings().removeClass('active');
    if ($(this).data('datatype') == 'income') {
        $('#totalProfit').html('1920 * 1080');
    } else if ($(this).data('datatype') == 'expend') {
        $('#totalProfit').html('ZHULING');
    }
})
;
